Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Any letters between C<?> and C<:> act as flags modifiers as with C<(?adluimsx-imsx)>.
es: Cualquier letra entre C<?> y C<:> actúa como modificador de marca con C<(?adluimsx-imsx)>.

source: Any number of C<(*MARK)> patterns are allowed, and the NAME portion may be duplicated.
es: Se puede usar un número arbitrario de patrones C<(*MARK)> y la parte del NOMBRE puede estar duplicada.

source: Any number of C<(*PRUNE)> assertions may be used in a pattern.
es: Un patrón puede incluir un número arbitrario de aserciones C<(*PRUNE)>.

source: Any of these modifiers can be set to apply globally to all regular expressions compiled within the scope of a C<use re>.
es: Cualquiera de estos modificadores se puede aplicar globalmente a todas las expresiones regulares compiladas dentro del ámbito de C<use re>.

source: Any pattern containing a special backtracking verb that allows an argument has the special behaviour that when executed it sets the current package's C<$REGERROR> and C<$REGMARK> variables.
es: Cualquier patrón con un verbo especial para la vuelta atrás que admita un argumento tiene un comportamiento especial consistente en que, cuando se ejecuta, establece los valores de las variables C<$REGERROR> y C<$REGMARK> del paquete actual.

source: Any positive flags (except C<"d">) may follow the caret, so
es: El signo de intercalación puede ir seguido de cualquier marca positiva (salvo C<"d">), por lo que

source: Any scalar value that doesn't evaluate to 0 or C<"">.
es: Cualquier valor escalar cuya evaluación no devuelva 0 o C<"">.

source: Any single character matches itself, unless it is a I<metacharacter> with a special meaning described here or above.
es: Cualquier carácter individual coincide consigo mismo, a menos que sea un I<metacarácter> con un significado especial descrito aquí o más arriba.

source: Any statement within the body of a loop that can make a loop prematurely stop looping or skip an L</iteration>.
es: Cualquier instrucción del cuerpo de un bucle que puede hacer que el bucle se detenga prematuramente u omita una L</iteración>.

source: Any switch with an additional L</argument> must be the last switch in a cluster.
es: Cualquier modificador que tenga un L</argumento> adicional deberá ser el último modificador del grupo.

source: Any switches in the C<PERLDOC> environment variable will be used before the command line arguments.
es: Se consumen todos los modificadores de la variable de entorno C<PERLDOC> antes que los argumentos de línea de comandos.

source: Any time after Perl starts running your main program.
es: Cualquier momento posterior al comienzo de la ejecución del programa principal.

source: Any time before Perl starts running your main program.
es: Cualquier momento antes de que el intérprete de Perl inicie la ejecución del programa principal.

source: Anything else is unsafe.
es: Cualquier otro caso no es seguro.

source: Anything may be considered portable if you try hard enough.
es: Todo nos parecerá portable si lo deseamos con la suficiente intensidad.

source: Anything that's likely to fill a hole in the communal library and which someone else can slot directly into their program.
es: Todo aquello que llene un vacío en la biblioteca común y que alguien pueda usar directamente en sus programas.

source: Anything you can legally say in a spot where a L</value> is required.
es: Todo lo que sea válido en un punto del programa que requiera un L</valor>.

source: Appeal to their self interest!
es: Hágales ver que es por su propio interés.

source: Applying Rename Leon Brocard to Orange Brocard
es: Applying Cambiar nombre de Leon Brocard a Orange Brocard

source: Arguments are forced into the integer format if not strings.
es: Fuerzan la conversión de los argumentos al formato de entero si no son cadenas.

source: Arrays and slices are interpolated into double-quoted strings by joining the elements with the delimiter specified in the C<$"> variable (C<$LIST_SEPARATOR> if "use English;" is specified), space by default.
es: Dentro de cadenas escritas entre comillas dobles, los arrays y las porciones se interpolan uniendo los elementos con el delimitador especificado en la variable C<$"> (C<$LIST_SEPARATOR> si se especifica "use English;"); el valor predeterminado es un espacio en blanco.

source: Arrays are zero-indexed.
es: El índice de un array empieza en cero.

source: As a verb, to resolve a partially compiled file's unresolved symbols into a (nearly) executable image.
es: El verbo (vincular) significa resolver los símbolos no resueltos de un archivo parcialmente compilado como una imagen (casi) ejecutable.

source: As explained below in L</Extended Patterns> it is possible to explicitly specify modifiers that apply only to portions of a regular expression.
es: Como se explica más abajo en L</Patrones extendidos>, es posible especificar explícitamente los modificadores que se aplican solo a unas partes de una expresión regular.

source: As with most other power tools, power comes together with the ability to wreak havoc.
es: Como ocurre con la mayoría de las herramientas eficaces, esta gran eficacia va a acompañada de la capacidad de causar estragos.

source: As C<\d*> can match on an empty string the complete regular expression matched successfully.
es: Como C<\d*> puede coincidir con una cadena vacía, coincide toda la expresión regular.

source: As I'm sure you have already guessed, this is a problem that DBM Filters can fix very easily.
es: Como ya se habrá imaginado, éste es un problema que se puede solucionar fácilmente con filtros DBM.

source: As a transitive verb, to create an L</object> using a L</constructor>.
es: El verbo transitivo significa crear un L</objeto> con un L</constructor>.

source: As a beginning Perl programmer, your most common use of OO Perl will be in using third-party modules, which are documented below.
es: La aplicación que suelen hacer los programadores principiantes de la programación orientada a objetos en Perl es la utilización de módulos de terceros, que se describe a continuación.

source: As a last resort, you can use the perl one-liner:
es: Como último recurso, puede ejecutar el siguiente comando perl de una sola línea:

source: As a matter of policy we do B<not> edit the history of the blead and maint-* branches.
es: Tenemos la política de B<no> editar el historial las ramas de blead y maint-*.

source: As a noun, a piece of syntax made up of smaller pieces.
es: El sustantivo se refiere a un fragmento de sintaxis formado por piezas más pequeñas.

source: As a shortcut C<(*MARK:NAME)> can be written C<(*:NAME)>.
es: C<(*MARK:NOMBRE)> se puede abreviar como C<(*:NOMBRE)>.

source: As a special case
es: Como un caso especial

source: As a workaround for this problem, Perl 5.10.0 introduces C<${^PREMATCH}>, C<${^MATCH}> and C<${^POSTMATCH}>, which are equivalent to C<$`>, C<$&> and C<$'>, B<except> that they are only guaranteed to be defined after a successful match that was executed with the C</p> (preserve) modifier.
es: Como solución para este problema, en Perl 5.10.0 se incluyeron C<${^PREMATCH}>, C<${^MATCH}> y C<${^POSTMATCH}>, que son equivalentes a C<$`>, C<$&> y C<$'>, B<con la diferencia> de que solo se garantiza que estén definidos tras encontrar una coincidencia con el modificador C</p> (preservar).

source: As an alternative, overloaded constants (see L<overload>) provide a simple way to extend the functionality of the RE engine, by substituting one pattern for another.
es: Como alternativa, las constantes sobrecargadas (vea L<overload>) proporcionan una manera sencilla de extender la funcionalidad del motor de expresiones regulares mediante la sustitución de un patrón por otro.

source: As an example, C<find2perl . -user root -perm 4000 -print> produces the following callback subroutine for C<File::Find>:
es: Por ejemplo, C<find2perl . -user root -perm 4000 -print> genera la siguiente subrutina de devolución de llamada para C<File::Find>:

source: As before, the rules to determine where the C<code> ends are currently somewhat convoluted.
es: Como antes, las reglas para determinar el lugar donde el C<código> termina son algo enrevesadas.

source: As documented in L<overload>, this conversion will work only over literal parts of regular expressions.
es: Como se documenta en L<overload>, esta conversión funcionará solo en las partes literales de las expresiones regulares.

source: As in some shells, you can enclose the variable name in braces to disambiguate it from following alphanumerics (and underscores).
es: Al igual que en algunos entornos de líneas de comandos, puede escribir el nombre de la variable entre llaves para eliminar la ambigüedad de los ulteriores caracteres alfanuméricos (y guiones bajos).

source: As it happens, using C<@array> where Perl expects to find a scalar value ("in scalar context") will give you the number of elements in the array:
es: Si utiliza C<@array> donde Perl espera encontrar un valor escalar ("en contexto de escalar"), obtendrá el número de elementos del array:

source: As mentioned earlier, Perl can store a number in any one of three formats, but most operators typically understand only one of those formats.
es: Como se mencionó antes, Perl puede almacenar un número en uno de tres formatos distintos, pero la mayoría de los operadores suelen admitir solo uno de esos formatos.

source: As noted earlier in this document, the scalar sense of list assignment is the number of elements on the right-hand side of the assignment.
es: Como se ha señalado anteriormente en este documento, el sentido escalar de una asignación de lista es el número de elementos en el lado derecho de la asignación.

source: As of 5.005, C<$&> is not so costly as the other two.
es: A partir de la versión 5.005, el uso de C<$&> no es tan costoso como el de las otras variables.

source: As of Perl 5.10, it even has a case/switch statement (spelled C<given>/C<when>).
es: En Perl 5.10, incluso ofrece una instrucción case/switch (llamada C<given>/C<when>).

source: As of Perl 5.10.0, Perl supports several Python/PCRE-specific extensions to the regex syntax.
es: A partir de Perl 5.10.0 se admiten varias extensiones específicas de Python/PCRE para la sintaxis de expresiones regulares.

source: As of Perl 5.10.0, one can create custom regular expression engines.
es: A partir de Perl 5.10.0 es posible crear motores de expresiones regulares personalizados.

source: As of Perl 5.10.1 there is a new interface for plugging and using method resolution orders other than the default (linear depth first search).
es: En Perl 5.10.1 se incluyó una nueva interfaz para conectar y usar órdenes de resolución de métodos distintos del predeterminado (búsqueda lineal en profundidad).

source: As pragmata are implemented as modules, like any other module, C<use myint;> becomes
es: Los pragmas se implementan como cualquier módulo, por lo que C<use entero;> se convierte en:

source: As the comment says, this is not a good way to implement accessors.
es: Como se indica en el comentario, esta no es una forma adecuada de implementar los métodos de acceso.

source: As this can lead to unexpected results, it is best to specify which other rule set should be used.
es: Como esto puede producir resultados inesperados, lo mejor es especificar el conjunto de reglas que se debe usar.

source: As we mentioned before, Perl's built-in OO system is very minimal, but also quite flexible.
es: Como ya se ha mencionado antes, el sistema predefinido de orientación a objetos de Perl es minimalista, pero también muy flexible.

source: As we mentioned before, roles provide an alternative to inheritance, but Perl does not have any built-in role support.
es: Como se mencionó con anterioridad, los roles proporcionan un alternativa a la herencia, pero Perl no ofrece esta característica de forma predefinida.

source: As we mentioned earlier, Perl provides no special constructor syntax.
es: Como se ha mencionado previamente, Perl no incluye una sintaxis especial para los constructores.

source: As we said before, Perl's minimal OO system has led to a profusion of OO systems on CPAN.
es: Como se indicó con anterioridad, el sistema de orientación a objetos de Perl es minimalista y esto ha hecho que surgieran muchos sistemas de programación orientada a objetos en CPAN.

source: As we said earlier, most Perl objects are hashes, but an object can be an instance of any Perl data type (scalar, array, etc.).
es: Como se ha indicado anteriormente, la mayoría de los objetos de Perl son hashes, pero un objeto puede ser una instancia de cualquier tipo de datos de Perl (escalar, array, etc).

source: As we saw earlier, an object is simply a data structure that has been blessed into a class via the C<bless> function.
es: Como ya se vio, un objeto no es más que una estructura de datos bendecida en una clase mediante la función C<bless>.

source: As well as grouping, parentheses serve a second purpose.
es: Además de para agrupar, los paréntesis también

source: As well as these filters for converting other languages, the L<pl2pm|pl2pm> utility will help you convert old-style Perl 4 libraries to new-style Perl5 modules.
es: Además de estos filtros para traducir otros lenguajes, la utilidad L<pl2pm|pl2pm> permite convertir bibliotecas de código Perl 4 antiguo en módulos de Perl 5 modernos.

source: As well as these two, there are two other converters: F<pod2html> will produce HTML pages from POD, and F<pod2latex>, which produces LaTeX files.
es: Hay otros dos conversores: F<pod2html> genera páginas HTML a partir de POD y F<pod2latex> genera archivos LaTeX.

source: As with constructors, Perl provides no special accessor declaration syntax, so classes must provide explicitly written accessor methods.
es: Como ocurre con los constructores, en Perl no hay una sintaxis especial para la declaración de los métodos de acceso, de forma que las clases deben proporcionar métodos de acceso escritos explícitamente para ellas.

source: As with filehandles and labels, a bareword that consists entirely of lowercase letters risks conflict with future reserved words, and if you use the C<use warnings> pragma or the B<-w> switch, Perl will warn you about any such words.
es: Al igual que con los identificadores de archivo y las etiquetas, una palabra suelta formada por un conjunto de letras minúsculas supone un riesgo de conflicto con futuras palabras reservadas, por lo que si se usa el pragma C<use warnings> o la opción B<-w>, Perl mostrará una advertencia.

source: As you can see, we've stored the path and file data in the object itself.
es: Como puede verse, hemos almacenado la ruta y los datos del archivo en el mismo objeto.

source: As you see, this can be a bit tricky.
es: Como ve, esto puede ser un poco complicado.

source: As you would expect, this modifier causes, for example, C<\D> to mean the same thing as C<[^0-9]>; in fact, all non-ASCII characters match C<\D>, C<\S>, and C<\W>.
es: Como era de esperar, este modificador hace que, por ejemplo, C<\D> quiera decir lo mismo que C<[^0-9]>; de hecho, todos los caracteres no incluidos en ASCII coinciden con C<\D>, C<\S> y C<\W>.

source: Assigning to C<$#days> actually changes the length of the array.
es: Asignar un valor a C<$#jornadas> cambia la longitud del array.

source: Assignment is a little bit special in that it uses its left argument to determine the context for the right argument.
es: La asignación es un poco especial en el sentido de que utiliza el argumento de la izquierda para determinar el contexto del argumento de la derecha.

source: Assignment to a scalar evaluates the right-hand side in scalar context, while assignment to an array or hash evaluates the righthand side in list context.
es: La asignación a un escalar evalúa lo que hay en el lado derecho en contexto de escalar, mientras que la asignación a un array o a un hash evalúa el lado derecho en contexto de lista.

source: Assignment to a list (or slice, which is just a list anyway) also evaluates the right-hand side in list context.
es: La asignación a una lista (o a una porción, que también es una lista después de todo) también evalúa el lado derecho en contexto de lista.

source: Assignment to a typeglob performs an aliasing operation, i.e.,
es: Una asignación a un I<typeglob> realiza una operación de creación de alias. Por ejemplo:

source: Assuming that you'd like to commit all the changes you've made as a single atomic unit, run this command:
es: Suponiendo que desea confirmar todos los cambios que ha realizado como una unidad atómica individual, ejecute este comando:

source: Assuming we are on the branch C<blead> immediately after a pull, this command would be more or less equivalent to:
es: Suponiendo que estamos en la rama C<blead> inmediatamente después de incorporar cambios, este comando será aproximadamente equivalente a:

source: At The Second O'Reilly Open Source Software Convention, Larry Wall announced Perl 6 development would begin in earnest.
es: En la Segunda Convención de Software Open Source de O'Reilly, Larry Wall anunció que el desarrollo de Perl 6 iba a empezar en serio.

source: At any given time, exactly one of these modifiers is in effect.
es: En un momento dado solo puede estar en vigor uno de estos modificadores.

source: At each position of the string the best match given by non-greedy C<??> is the zero-length match, and the I<second best> match is what is matched by C<\w>.
es: En cada posición de la cadena, la mejor opción dada por el modificador no avaricioso C<??> es la coincidencia de longitud cero, y la I<segunda mejor> coincidencia es la que se corresponde con C<\w>.

source: At one extreme, you might say that all versions of Unix and Unix-lookalikes are the same operating system (upsetting many people, especially lawyers and other advocates).
es: En un extremo, se puede decir que todas las versiones de Unix y los sistemas similares a Unix son un mismo sistema operativo (lo que molestará a muchas personas, especialmente a abogados y otros defensores).

source: At other times, you might prefer to determine whether string data can be used numerically by calling the POSIX::strtod() function or by inspecting your string with a regular expression (as documented in L<perlre>).
es: En otros casos, es posible que sea preferible determinar si se puede usar una cadena de datos numéricamente llamando a la función POSIX::strtod() o inspeccionando la cadena con una expresión regular (como se explica en L<perlre>).

source: At that point C<$bar> is no longer storing a reference to an object.
es: En ese momento C<$bar> ya no almacena una referencia a un objeto.

source: At the cost of a little more overhead, you can do this by using the /m modifier on the pattern match operator.
es: A costa de una ligera sobrecarga, puede hacer esto mediante el modificador /m en el patrón del operador de detección de coincidencias de patrones.

source: At the other extreme, you could say this particular version of this particular vendor's operating system is different from any other version of this or any other vendor's operating system.
es: En el otro extremo, se puede decir que esta versión concreta del sistema operativo de este fabricante concreto es distinta de cualquier otra versión de sistema operativo de este fabricante o de cualquier otro fabricante.

source: At the very least, remember this: modules should be title capitalised, (This::Thing) fit in with a category, and explain their purpose succinctly.
es: Como mínimo, debe recordar que las palabras que componen el nombre de un módulo deben escribirse con la letra inicial mayúscula (Este::Programa) y que cada módulo debe pertenecer a una categoría e incluir una descripción de su propósito.

source: At the very least it will let some poor schmuck bounce on the % key in B<vi>.
es: Por lo menos así los tontos podrán usar la tecla % en B<vi>.

source: At the workshops, subjects range from a beginner's introduction (such as the Pittsburgh Perl Workshop's "Zero To Perl") to much more advanced subjects.
es: Estos talleres cubren temas que van desde la iniciación de principiantes (como la clase "Zero to Perl" del Pittsburgh Perl Workshop) hasta temas mucho más avanzados.

source: At various points, however, it temporarily switches back to the C<main> package to evaluate various expressions in the context of the C<main> package (or wherever you came from).
es: Sin embargo, en varios puntos cambia temporalmente al paquete C<main> para evaluar diversas expresiones en este contexto (o en el contexto en el que esté trabajando).

source: Attribute inheritance is left up the class to implement.
es: La herencia de atributos debe implementarse en la clase.

source: Attributes are often stored in the object itself.
es: Los atributos se suelen almacenar en el mismo objeto.

source: Attributes are sometimes called B<properties>.
es: Los atributos también se suelen llamar B<propiedades>.

source: Attributes are typically defined as read-only or read-write.
es: Los atributos se suelen definir como de solo lectura o de lectura y escritura.

source: Avoid using C<grep()> (or C<map()>) or `backticks` in a void context, that is, when you just throw away their return values.
es: Evite usar C<grep()> (o C<map()>) o `acentos graves` en un contexto nulo (es decir, desechando los valores de retorno).

source: Awake!
es: ¡Despierta!

# Awake! ";
source: Awake!\n";
es: ¡Despierta!\n";

source: B<Binary strings>, or B<byte strings> are made of bytes.
es: Las B<cadenas binarias> (o B<cadenas de bytes>) están constituidas por bytes.

source: B<D>escribes search for the item in B<d>etail.
es: B<D>escribe de manera B<d>etallada la búsqueda de un elemento.

source: B<Decoding> is the conversion from I<binary> to I<text>.
es: B<Descodificar> consiste en convertir I<binario> a I<texto>.

source: B<Don't> attempt to store references to data structures as integers which are retrieved via C<caller> and converted back, as this will not be threadsafe.
es: B<No> intente almacenar referencias a estructuras de datos como enteros que se recuperan a través de C<caller> y se vuelven a convertir, ya que esto no garantiza una ejecución segura.

source: B<Encapsulation> is the idea that an object is opaque.
es: La B<encapsulación> expresa la idea de que los objetos son opacos.

source: B<Encoding> (as a verb) is the conversion from I<text> to I<binary>.
es: B<Codificar> consiste en convertir I<texto> a I<binario>.

source: B<If you're on MVS>,
es: B<Si usa MVS>:

source: B<If you're on OS/2,>
es: B<Si usa OS/2>:

source: B<If you're on VMS,>
es: B<Si usa VMS>:

source: B<If you're on a Unix or Unix-like system,>
es: B<Si usa un sistema Unix o similar>:

source: B<If you're on the DJGPP port of DOS,>
es: B<Si usa una versión DJGPP de DOS>:

source: B<If you're running ActivePerl (Win95/98/2K/NT/XP, Linux, Solaris)>
es: B<Si usa ActivePerl (Win95/98/2K/NT/XP, Linux, Solaris)>:

source: B<If you're using a Macintosh with "Classic" MacOS and MacPerl,>
es: B<Si usa un equipo Macintosh con MacOS "Classic" y MacPerl>:

source: B<Inheritance> lets you create a specialized version of an existing class.
es: La B<herencia> permite crear una versión especializada de una clase existente.

source: B<Invocant> is a fancy name for the thing on the left side of the arrow.
es: B<Autor de la llamada> es un nombre elaborado que simplemente quiere decir lo que está a la izquierda de la flecha.

source: B<NOTE:> C<$REGERROR> and C<$REGMARK> are not magic variables like C and most other regex-related variables.
es: B<NOTA:> C<$REGERROR> y C<$REGMARK> no son variables mágicas como C y la mayoría de las demás variables relacionadas con las expresiones regulares.
